---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.DuctPressureDropData
source: html/5971c6bf-d043-5973-dc33-1f5c6ab66704.htm
---
# DuctPressureDropData Members

Releases all resources used by the DuctPressureDropData